[Killed] BlockStatement
WebstormProjects/refactoring/src/rover.js:6:30
     position;
     facing;
 
-    constructor(x, y, facing){
-        this.position = {x: x, y: y};
-        this.facing = facing;
-    }
+    constructor(x, y, facing){}
 
     go(instructions) {

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:14:17
     go(instructions) {
 
         return Array.from(instructions).reduce((rover, instruction) => {
-            if (instruction == 'R') {
+            if (true) {
                 if (rover.facing == 'N')
                     return {...rover, facing: "E"};

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:14:17
     go(instructions) {
 
         return Array.from(instructions).reduce((rover, instruction) => {
-            if (instruction == 'R') {
+            if (false) {
                 if (rover.facing == 'N')
                     return {...rover, facing: "E"};

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:15:21
 
         return Array.from(instructions).reduce((rover, instruction) => {
             if (instruction == 'R') {
-                if (rover.facing == 'N')
+                if (true)
                     return {...rover, facing: "E"};
 

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:15:21
 
         return Array.from(instructions).reduce((rover, instruction) => {
             if (instruction == 'R') {
-                if (rover.facing == 'N')
+                if (false)
                     return {...rover, facing: "E"};
 

[Killed] EqualityOperator
WebstormProjects/refactoring/src/rover.js:18:21
                 if (rover.facing == 'N')
                     return {...rover, facing: "E"};
 
-                if (rover.facing == 'E')
+                if (rover.facing != 'E')
                     return {...rover, facing: 'S'};
 

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:18:21
                 if (rover.facing == 'N')
                     return {...rover, facing: "E"};
 
-                if (rover.facing == 'E')
+                if (false)
                     return {...rover, facing: 'S'};
 

[Killed] StringLiteral
WebstormProjects/refactoring/src/rover.js:19:47
                     return {...rover, facing: "E"};
 
                 if (rover.facing == 'E')
-                    return {...rover, facing: 'S'};
+                    return {...rover, facing: ""};
 
                 if (rover.facing == 'S')

[Killed] ObjectLiteral
WebstormProjects/refactoring/src/rover.js:19:28
                     return {...rover, facing: "E"};
 
                 if (rover.facing == 'E')
-                    return {...rover, facing: 'S'};
+                    return {};
 
                 if (rover.facing == 'S')

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:21:21
                 if (rover.facing == 'E')
                     return {...rover, facing: 'S'};
 
-                if (rover.facing == 'S')
+                if (false)
                     return {...rover, facing: 'W'};
 

[Killed] EqualityOperator
WebstormProjects/refactoring/src/rover.js:21:21
                 if (rover.facing == 'E')
                     return {...rover, facing: 'S'};
 
-                if (rover.facing == 'S')
+                if (rover.facing != 'S')
                     return {...rover, facing: 'W'};
 

[Killed] StringLiteral
WebstormProjects/refactoring/src/rover.js:24:43
                 if (rover.facing == 'S')
                     return {...rover, facing: 'W'};
 
-                return {...rover, facing: 'N'};
+                return {...rover, facing: ""};
             }
             ;

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:28:17
             }
             ;
 
-            if (instruction == 'L') {
+            if (false) {
                 if (rover.facing == 'N')
                     return {...rover, facing: "W"};

[Killed] BlockStatement
WebstormProjects/refactoring/src/rover.js:28:37
             }
             ;
 
-            if (instruction == 'L') {
-                if (rover.facing == 'N')
-                    return {...rover, facing: "W"};
-
-                if (rover.facing == 'W')
-                    return {...rover, facing: 'S'};
-
-                if (rover.facing == 'S')
-                    return {...rover, facing: 'E'};
-
-                return {...rover, facing: 'N'};
-            }
+            if (instruction == 'L') {}
 
             if (instruction == 'F') {

[Killed] EqualityOperator
WebstormProjects/refactoring/src/rover.js:29:21
             ;
 
             if (instruction == 'L') {
-                if (rover.facing == 'N')
+                if (rover.facing != 'N')
                     return {...rover, facing: "W"};
 

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:29:21
             ;
 
             if (instruction == 'L') {
-                if (rover.facing == 'N')
+                if (false)
                     return {...rover, facing: "W"};
 

[Killed] ObjectLiteral
WebstormProjects/refactoring/src/rover.js:30:28
 
             if (instruction == 'L') {
                 if (rover.facing == 'N')
-                    return {...rover, facing: "W"};
+                    return {};
 
                 if (rover.facing == 'W')

[Killed] EqualityOperator
WebstormProjects/refactoring/src/rover.js:32:21
                 if (rover.facing == 'N')
                     return {...rover, facing: "W"};
 
-                if (rover.facing == 'W')
+                if (rover.facing != 'W')
                     return {...rover, facing: 'S'};
 

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:32:21
                 if (rover.facing == 'N')
                     return {...rover, facing: "W"};
 
-                if (rover.facing == 'W')
+                if (true)
                     return {...rover, facing: 'S'};
 

[Killed] ObjectLiteral
WebstormProjects/refactoring/src/rover.js:36:28
                     return {...rover, facing: 'S'};
 
                 if (rover.facing == 'S')
-                    return {...rover, facing: 'E'};
+                    return {};
 
                 return {...rover, facing: 'N'};

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:41:17
                 return {...rover, facing: 'N'};
             }
 
-            if (instruction == 'F') {
+            if (true) {
                 if (rover.facing == 'N')
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};

[Killed] EqualityOperator
WebstormProjects/refactoring/src/rover.js:41:17
                 return {...rover, facing: 'N'};
             }
 
-            if (instruction == 'F') {
+            if (instruction != 'F') {
                 if (rover.facing == 'N')
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:42:21
             }
 
             if (instruction == 'F') {
-                if (rover.facing == 'N')
+                if (true)
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:42:21
             }
 
             if (instruction == 'F') {
-                if (rover.facing == 'N')
+                if (false)
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:43:72
 
             if (instruction == 'F') {
                 if (rover.facing == 'N')
-                    return {...rover, position: {...rover.position, y: rover.position.y + 1}};
+                    return {...rover, position: {...rover.position, y: rover.position.y - 1}};
 
                 if (rover.facing == 'E')

[Killed] ObjectLiteral
WebstormProjects/refactoring/src/rover.js:43:28
 
             if (instruction == 'F') {
                 if (rover.facing == 'N')
-                    return {...rover, position: {...rover.position, y: rover.position.y + 1}};
+                    return {};
 
                 if (rover.facing == 'E')

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:45:21
                 if (rover.facing == 'N')
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 
-                if (rover.facing == 'E')
+                if (true)
                     return {...rover, position: {...rover.position, x: rover.position.x + 1}};
 

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:46:72
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 
                 if (rover.facing == 'E')
-                    return {...rover, position: {...rover.position, x: rover.position.x + 1}};
+                    return {...rover, position: {...rover.position, x: rover.position.x - 1}};
 
                 if (rover.facing == 'S')

[Killed] ObjectLiteral
WebstormProjects/refactoring/src/rover.js:46:49
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 
                 if (rover.facing == 'E')
-                    return {...rover, position: {...rover.position, x: rover.position.x + 1}};
+                    return {...rover, position: {}};
 
                 if (rover.facing == 'S')

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:49:72
                     return {...rover, position: {...rover.position, x: rover.position.x + 1}};
 
                 if (rover.facing == 'S')
-                    return {...rover, position: {...rover.position, y: rover.position.y - 1}};
+                    return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 
                 return {rover, position: {...rover.position, x: rover.position.x - 1}};

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:51:65
                 if (rover.facing == 'S')
                     return {...rover, position: {...rover.position, y: rover.position.y - 1}};
 
-                return {rover, position: {...rover.position, x: rover.position.x - 1}};
+                return {rover, position: {...rover.position, x: rover.position.x + 1}};
             }
             ;

[Killed] ObjectLiteral
WebstormProjects/refactoring/src/rover.js:51:24
                 if (rover.facing == 'S')
                     return {...rover, position: {...rover.position, y: rover.position.y - 1}};
 
-                return {rover, position: {...rover.position, x: rover.position.x - 1}};
+                return {};
             }
             ;

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:55:17
             }
             ;
 
-            if (instruction == 'B') {
+            if (true) {
                 if (rover.facing == 'N')
                     return {...rover, position: {...rover.position, y: rover.position.y - 1}};

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:55:17
             }
             ;
 
-            if (instruction == 'B') {
+            if (false) {
                 if (rover.facing == 'N')
                     return {...rover, position: {...rover.position, y: rover.position.y - 1}};

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:56:21
             ;
 
             if (instruction == 'B') {
-                if (rover.facing == 'N')
+                if (true)
                     return {...rover, position: {...rover.position, y: rover.position.y - 1}};
 

[Killed] EqualityOperator
WebstormProjects/refactoring/src/rover.js:56:21
             ;
 
             if (instruction == 'B') {
-                if (rover.facing == 'N')
+                if (rover.facing != 'N')
                     return {...rover, position: {...rover.position, y: rover.position.y - 1}};
 

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:57:72
 
             if (instruction == 'B') {
                 if (rover.facing == 'N')
-                    return {...rover, position: {...rover.position, y: rover.position.y - 1}};
+                    return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 
                 if (rover.facing == 'E')

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:60:72
                     return {...rover, position: {...rover.position, y: rover.position.y - 1}};
 
                 if (rover.facing == 'E')
-                    return {...rover, position: {...rover.position, x: rover.position.x - 1}};
+                    return {...rover, position: {...rover.position, x: rover.position.x + 1}};
 
                 if (rover.facing == 'S')

[Killed] ConditionalExpression
WebstormProjects/refactoring/src/rover.js:62:21
                 if (rover.facing == 'E')
                     return {...rover, position: {...rover.position, x: rover.position.x - 1}};
 
-                if (rover.facing == 'S')
+                if (true)
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:63:72
                     return {...rover, position: {...rover.position, x: rover.position.x - 1}};
 
                 if (rover.facing == 'S')
-                    return {...rover, position: {...rover.position, y: rover.position.y + 1}};
+                    return {...rover, position: {...rover.position, y: rover.position.y - 1}};
 
                 return {rover, position: {...rover.position, x: rover.position.x + 1}};

[Killed] ObjectLiteral
WebstormProjects/refactoring/src/rover.js:63:28
                     return {...rover, position: {...rover.position, x: rover.position.x - 1}};
 
                 if (rover.facing == 'S')
-                    return {...rover, position: {...rover.position, y: rover.position.y + 1}};
+                    return {};
 
                 return {rover, position: {...rover.position, x: rover.position.x + 1}};

[Killed] ArithmeticOperator
WebstormProjects/refactoring/src/rover.js:65:65
                 if (rover.facing == 'S')
                     return {...rover, position: {...rover.position, y: rover.position.y + 1}};
 
-                return {rover, position: {...rover.position, x: rover.position.x + 1}};
+                return {rover, position: {...rover.position, x: rover.position.x - 1}};
             }
 
